<a href="https://colab.research.google.com/github/anko191/Python_Kaggle/blob/master/pandas/pandas_sort.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
df = pd.read_csv('/content/sample_pandas_normal.csv')
print(df)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [9]:
df_s = df.sort_values('state')
print(df_s)

      name  age state  point
1      Bob   42    CA     92
2  Charlie   18    CA     70
4    Ellen   24    CA     88
0    Alice   24    NY     64
5    Frank   30    NY     57
3     Dave   68    TX     70

In [10]:
df_s = df_s.reset_index(drop = True)

In [11]:
print(df_s)

      name  age state  point
0      Bob   42    CA     92
1  Charlie   18    CA     70
2    Ellen   24    CA     88
3    Alice   24    NY     64
4    Frank   30    NY     57
5     Dave   68    TX     70

In [12]:
df_s = df.sort_values('state', ascending = False)
print(df_s)

      name  age state  point
3     Dave   68    TX     70
0    Alice   24    NY     64
5    Frank   30    NY     57
1      Bob   42    CA     92
2  Charlie   18    CA     70
4    Ellen   24    CA     88

In [13]:
df_s = df_s.reset_index(drop = True)
print(df_s)

      name  age state  point
0     Dave   68    TX     70
1    Alice   24    NY     64
2    Frank   30    NY     57
3      Bob   42    CA     92
4  Charlie   18    CA     70
5    Ellen   24    CA     88

In [14]:
df_s = df.sort_values(['state', 'age'])
print(df_s)

      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88
1      Bob   42    CA     92
0    Alice   24    NY     64
5    Frank   30    NY     57
3     Dave   68    TX     70

In [15]:
df_s = df.sort_values(['age', 'state'])
print(df_s)

      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88
0    Alice   24    NY     64
5    Frank   30    NY     57
1      Bob   42    CA     92
3     Dave   68    TX     70

In [16]:
df_s = df.sort_values(['age', 'state'], ascending = [True, False])
print(df_s)

      name  age state  point
2  Charlie   18    CA     70
0    Alice   24    NY     64
4    Ellen   24    CA     88
5    Frank   30    NY     57
1      Bob   42    CA     92
3     Dave   68    TX     70

In [17]:
df_nan = df.copy()
df_nan.iloc[:2, 1] = pd.np.nan
print(df_nan)

      name   age state  point
0    Alice   NaN    NY     64
1      Bob   NaN    CA     92
2  Charlie  18.0    CA     70
3     Dave  68.0    TX     70
4    Ellen  24.0    CA     88
5    Frank  30.0    NY     57

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead

In [18]:
# default nan tail
df_nan_s = df_nan.sort_values('age')
print(df_nan_s)

      name   age state  point
2  Charlie  18.0    CA     70
4    Ellen  24.0    CA     88
5    Frank  30.0    NY     57
3     Dave  68.0    TX     70
0    Alice   NaN    NY     64
1      Bob   NaN    CA     92

In [19]:
df_nan_s = df_nan.sort_values('age', na_position='first')
print(df_nan_s)

      name   age state  point
0    Alice   NaN    NY     64
1      Bob   NaN    CA     92
2  Charlie  18.0    CA     70
4    Ellen  24.0    CA     88
5    Frank  30.0    NY     57
3     Dave  68.0    TX     70

In [30]:
df.sort_values('state', inplace = True)
print(df)

      name  age state  point
1      Bob   42    CA     92
2  Charlie   18    CA     70
4    Ellen   24    CA     88
0    Alice   24    NY     64
5    Frank   30    NY     57
3     Dave   68    TX     70

In [27]:
df_d = df.drop(['name', 'state'], axis = 1)
print(df_d)
df_d.sort_values(by = 0, axis = 1, ascending = False, inplace = True)
print(df_d)

   age  point
1   42     92
2   18     70
4   24     88
0   24     64
5   30     57
3   68     70
   point  age
1     92   42
2     70   18
4     88   24
0     64   24
5     57   30
3     70   68

In [42]:
df_d = df.drop(['name', 'state'], axis = 1)
print(df_d)
df_d.sort_values(by=5, axis = 1, ascending = True, inplace = True)
print(df_d)

   age  point
1   42     92
2   18     70
4   24     88
0   24     64
5   30     57
3   68     70
   age  point
1   42     92
2   18     70
4   24     88
0   24     64
5   30     57
3   68     70

In [43]:
df_s = df.sort_index()
print(df_s)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [44]:
df_s = df.sort_index(axis = 1)
print(df_s)

   age     name  point state
1   42      Bob     92    CA
2   18  Charlie     70    CA
4   24    Ellen     88    CA
0   24    Alice     64    NY
5   30    Frank     57    NY
3   68     Dave     70    TX

In [45]:
df.sort_index(axis = 1, ascending = False, inplace = True)
print(df)

  state  point     name  age
1    CA     92      Bob   42
2    CA     70  Charlie   18
4    CA     88    Ellen   24
0    NY     64    Alice   24
5    NY     57    Frank   30
3    TX     70     Dave   68

In [46]:
import pandas as pd
df = pd.read_csv('/content/sample_pandas_normal.csv')
print(df)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [47]:
df_s = df.sample(frac=1)
print(df_s)

      name  age state  point
3     Dave   68    TX     70
2  Charlie   18    CA     70
5    Frank   30    NY     57
4    Ellen   24    CA     88
0    Alice   24    NY     64
1      Bob   42    CA     92

In [48]:
df_s = df.sample(frac=1, random_state = 0)
print(df_s)

      name  age state  point
5    Frank   30    NY     57
2  Charlie   18    CA     70
1      Bob   42    CA     92
3     Dave   68    TX     70
0    Alice   24    NY     64
4    Ellen   24    CA     88

In [49]:
df_s = df.sample(frac = 1).reset_index(drop=True)
print(df_s)

      name  age state  point
0      Bob   42    CA     92
1    Alice   24    NY     64
2    Ellen   24    CA     88
3  Charlie   18    CA     70
4    Frank   30    NY     57
5     Dave   68    TX     70

In [50]:
df = df.sample(frac=1).reset_index(drop=True)
print(df)

      name  age state  point
0  Charlie   18    CA     70
1     Dave   68    TX     70
2      Bob   42    CA     92
3    Frank   30    NY     57
4    Ellen   24    CA     88
5    Alice   24    NY     64

In [51]:
df = df.sample(frac=1, random_state= 1)

In [52]:
print(dff)

NameError: ignored

In [54]:
df.reset_index(drop=True)

      name  age state  point
0      Bob   42    CA     92
1     Dave   68    TX     70
2    Ellen   24    CA     88
3  Charlie   18    CA     70
4    Frank   30    NY     57
5    Alice   24    NY     64